docs/leets/1190-Reverse-Substrings-Between-Each-Pair-of-Parentheses.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1190. Reverse Substrings Between Each Pair of Parentheses</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-11
</div>
<div id="content" class="content">
<header>
<h1 class="title">1190. Reverse Substrings Between Each Pair of Parentheses</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ea5071">Links:</a></li>
<li><a href="#org68f03c0">Problem:</a></li>
<li><a href="#org259df2a">Solution Description:</a></li>
<li><a href="#orgc3a15e3">Example:</a></li>
<li><a href="#org8b77769">Setup:</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org1ea5071" class="outline-2">
<h2 id="org1ea5071">Links:</h2>
<div class="outline-text-2" id="text-org1ea5071">
<ul class="org-ul">
<li><a href="./1190-Reverse-Substrings-Between-Each-Pair-of-Parentheses.html">1190-Reverse-Substrings-Between-Each-Pair-of-Parentheses.org</a></li>
<li>submission: <a href="https://leetcode.com/submissions/detail/1317774463/">Reverse Substrings Between Each Pair of Parentheses</a></li>
</ul>
</div>
</div>

<div id="outline-container-org68f03c0" class="outline-2">
<h2 id="org68f03c0">Problem:</h2>
<div class="outline-text-2" id="text-org68f03c0">
<p>
Given a string `s` which consists of lowercase English letters and brackets. Reverse substrings that are in each pair of matching parentheses from the innermost one to the outermost one, and return the resulting string without any parentheses.
</p>

<p>
For example:
</p>

<pre class="example" id="org2e42811">
Input: `s = "(ab(cd)e)"`
Output: `s = "edcba"`
</pre>
</div>
</div>

<div id="outline-container-org259df2a" class="outline-2">
<h2 id="org259df2a">Solution Description:</h2>
<div class="outline-text-2" id="text-org259df2a">
<p>
To implement the solution, we need to use a stack to manage the parentheses and the nested substrings efficiently.
</p>

<ol class="org-ol">
<li>Create an empty stack to keep track of characters.</li>
<li>Traverse the string character by character.</li>
<li>If an open parenthesis `(` is encountered, push it onto the stack.</li>
<li>If a closing parenthesis `)` is encountered, start popping from the stack until an open parenthesis `(` is found. Reverse the collected characters and push them back onto the stack.</li>
<li>After processing the entire string, the stack should contain the final result in the correct order. We then convert the stack to a string.</li>
</ol>

<p>
The time complexity is O(n) because we traverse the string twice (one push and one pop per character), where n is the length of the string. The space complexity is also O(n) because we store the characters in the stack.
</p>
</div>
</div>

<div id="outline-container-orgc3a15e3" class="outline-2">
<h2 id="orgc3a15e3">Example:</h2>
<div class="outline-text-2" id="text-orgc3a15e3">
<pre class="example" id="org715cdca">
Consider the input `s = "(u(love)i)"`.

1. Traverse and push `(`, `u`.
2. Push `(` again.
3. Traverse and push `l`, `o`, `v`, `e`.
4. Pop until `(`, reverse `love` to `evol`, and push characters back.
5. Continue pushing `i`, `)`.
6. Pop until `(`, reverse `uevoli` to `iloveu`.
The final stack holds `iloveu`.
</pre>
</div>
</div>

<div id="outline-container-org8b77769" class="outline-2">
<h2 id="org8b77769">Setup:</h2>
<div class="outline-text-2" id="text-org8b77769">
<p>
Below is the JavaScript function implementing the described solution, along with a set of test cases.
</p>

<div class="org-src-container">
<pre class="src src-js">/**
 * @param {string} s - Input string containing lowercase English letters and parentheses
 * @returns {string} - Final string after reversing substrings within parentheses
 */
function reverseParentheses(s) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;

    const stack = [];

    for (const ch of s) {

        if (ch !== ')') {
            stack.push(ch);
        } else {
            let tmp = '';
            while (stack.length &amp;&amp; stack[stack.length - 1] !== '(') {
                tmp += stack.pop();
            }
            stack.pop(); // remove the (

            for (const char of tmp) {
                stack.push(char);
            }
        }
    }

    return stack.join('');
}

// Test cases
const testCases = [
    { input: "(ed(et(oc))el)", expected: "leetcode"},
    { input: "(ab(cd)e)", expected: "ecdba" },
    { input: "(u(love)i)", expected: "iloveu" },
    { input: "a(bc(de)fg)", expected: "agfdecb" },
    { input: "((abc)def)", expected: "fedabc" },
    { input: "a(bc)de", expected: "acbde" },
];

testCases.forEach((test, index) =&gt; {
    const result = reverseParentheses(test.input);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
